Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase.GetObjects Method
 Gets the children straight dimensions of the current straight dimension set.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetObjects()
Public Function GetObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The children straight dimensions of the current straight dimension set.
Implements
IHasChildren.GetObjects()
See Also
Reference
DimensionSetBase Class
GetObjects Overload
Tekla.Structures.Drawing Namespace